Revit 2026 API

# RevisionVisibility Enumeration

---

Determines whether Revision Clouds and Revision Tags will be visible in the project.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RevisionVisibility
```
```vb
Public Enumeration RevisionVisibility
```
```cpp
public enum class RevisionVisibility
```
```fsharp
type RevisionVisibility
```

| Member name | Value | Description |
| --- | --- | --- |
| CloudAndTagVisible | 1 | Revision Clouds and Revision Tags will be visible in the project. |
| Hidden | 0 | Revision Clouds and Revision Tags will not be visible in the project. |
| TagVisible | 2 | Revision Tags will be visible in the project but Revision Clouds will not be. |

#### Reference

Autodesk.Revit.DB Namespace